ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/i2smcc.h
/* ---------------------------------------------------------------------------- */
/*                Microchip Microcontroller Software Support                    */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2021, Microchip Technology Inc.                                */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Microchip's name may not be used to endorse or promote products derived from */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS  */
/* OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES */
/* OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT    */
/* ARE DISCLAIMED. IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT,        */
/* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES           */
/* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; */
/* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND  */
/* ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   */
/* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF     */
/* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.            */
/* ---------------------------------------------------------------------------- */

#ifndef _PIC32CX_I2SMCC_COMPONENT_
#define _PIC32CX_I2SMCC_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Inter-IC Sound Multi Channel Controller */
/* ============================================================================= */
/** \addtogroup PIC32CX_I2SMCC Inter-IC Sound Multi Channel Controller */
/*@{*/

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief I2smcc hardware registers */
typedef struct {
  __O  uint32_t I2SMCC_CR;     /**< \brief (I2smcc Offset: 0x0) Control Register */
  __IO uint32_t I2SMCC_MRA;    /**< \brief (I2smcc Offset: 0x4) Mode Register A */
  __IO uint32_t I2SMCC_MRB;    /**< \brief (I2smcc Offset: 0x8) Mode Register B */
  __I  uint32_t I2SMCC_SR;     /**< \brief (I2smcc Offset: 0xC) Status Register */
  __O  uint32_t I2SMCC_IERA;   /**< \brief (I2smcc Offset: 0x10) Interrupt Enable Register A */
  __O  uint32_t I2SMCC_IDRA;   /**< \brief (I2smcc Offset: 0x14) Interrupt Disable Register A */
  __I  uint32_t I2SMCC_IMRA;   /**< \brief (I2smcc Offset: 0x18) Interrupt Mask Register A */
  __I  uint32_t I2SMCC_ISRA;   /**< \brief (I2smcc Offset: 0x1C) Interrupt Status Register A */
  __O  uint32_t I2SMCC_IERB;   /**< \brief (I2smcc Offset: 0x20) Interrupt Enable Register B */
  __O  uint32_t I2SMCC_IDRB;   /**< \brief (I2smcc Offset: 0x24) Interrupt Disable Register B */
  __I  uint32_t I2SMCC_IMRB;   /**< \brief (I2smcc Offset: 0x28) Interrupt Mask Register B */
  __I  uint32_t I2SMCC_ISRB;   /**< \brief (I2smcc Offset: 0x2C) Interrupt Status Register B */
  __I  uint32_t I2SMCC_RHR;    /**< \brief (I2smcc Offset: 0x30) Receiver Holding Register */
  __O  uint32_t I2SMCC_THR;    /**< \brief (I2smcc Offset: 0x34) Transmitter Holding Register */
  __I  uint32_t Reserved1[2];
  __I  uint32_t I2SMCC_RHL0R;  /**< \brief (I2smcc Offset: 0x40) Receiver Holding Left 0 Register */
  __I  uint32_t I2SMCC_RHR0R;  /**< \brief (I2smcc Offset: 0x44) Receiver Holding Right 0 Register */
  __I  uint32_t I2SMCC_RHL1R;  /**< \brief (I2smcc Offset: 0x48) Receiver Holding Left 1 Register */
  __I  uint32_t I2SMCC_RHR1R;  /**< \brief (I2smcc Offset: 0x4C) Receiver Holding Right 1 Register */
  __I  uint32_t I2SMCC_RHL2R;  /**< \brief (I2smcc Offset: 0x50) Receiver Holding Left 2 Register */
  __I  uint32_t I2SMCC_RHR2R;  /**< \brief (I2smcc Offset: 0x54) Receiver Holding Right 2 Register */
  __I  uint32_t I2SMCC_RHL3R;  /**< \brief (I2smcc Offset: 0x58) Receiver Holding Left 3 Register */
  __I  uint32_t I2SMCC_RHR3R;  /**< \brief (I2smcc Offset: 0x5C) Receiver Holding Right 3 Register */
  __O  uint32_t I2SMCC_THL0R;  /**< \brief (I2smcc Offset: 0x60) Transmitter Holding Left 0 Register */
  __O  uint32_t I2SMCC_THR0R;  /**< \brief (I2smcc Offset: 0x64) Transmitter Holding Right 0 Register */
  __O  uint32_t I2SMCC_THL1R;  /**< \brief (I2smcc Offset: 0x68) Transmitter Holding Left 1 Register */
  __O  uint32_t I2SMCC_THR1R;  /**< \brief (I2smcc Offset: 0x6C) Transmitter Holding Right 1 Register */
  __O  uint32_t I2SMCC_THL2R;  /**< \brief (I2smcc Offset: 0x70) Transmitter Holding Left 2 Register */
  __O  uint32_t I2SMCC_THR2R;  /**< \brief (I2smcc Offset: 0x74) Transmitter Holding Right 2 Register */
  __O  uint32_t I2SMCC_THL3R;  /**< \brief (I2smcc Offset: 0x78) Transmitter Holding Left 3 Register */
  __O  uint32_t I2SMCC_THR3R;  /**< \brief (I2smcc Offset: 0x7C) Transmitter Holding Right 3 Register */
  __I  uint32_t Reserved2[25];
  __IO uint32_t I2SMCC_WPMR;   /**< \brief (I2smcc Offset: 0xE4) Write Protection Mode Register */
  __I  uint32_t I2SMCC_WPSR;   /**< \brief (I2smcc Offset: 0xE8) Write Protection Status Register */
  __I  uint32_t Reserved3[5];
  __IO uint32_t I2SMCC_RPR;    /**< \brief (I2smcc Offset: 0x100) Receive Pointer Register */
  __IO uint32_t I2SMCC_RCR;    /**< \brief (I2smcc Offset: 0x104) Receive Counter Register */
  __IO uint32_t I2SMCC_TPR;    /**< \brief (I2smcc Offset: 0x108) Transmit Pointer Register */
  __IO uint32_t I2SMCC_TCR;    /**< \brief (I2smcc Offset: 0x10C) Transmit Counter Register */
  __IO uint32_t I2SMCC_RNPR;   /**< \brief (I2smcc Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t I2SMCC_RNCR;   /**< \brief (I2smcc Offset: 0x114) Receive Next Counter Register */
  __IO uint32_t I2SMCC_TNPR;   /**< \brief (I2smcc Offset: 0x118) Transmit Next Pointer Register */
  __IO uint32_t I2SMCC_TNCR;   /**< \brief (I2smcc Offset: 0x11C) Transmit Next Counter Register */
  __O  uint32_t I2SMCC_PTCR;   /**< \brief (I2smcc Offset: 0x120) Transfer Control Register */
  __I  uint32_t I2SMCC_PTSR;   /**< \brief (I2smcc Offset: 0x124) Transfer Status Register */
  __IO uint32_t I2SMCC_PWPMR;  /**< \brief (I2smcc Offset: 0x128) Write Protection Mode Register */
} I2smcc;
