ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/i2smcc.h
#define I2SMCC_ISRA_RXRRDY1 (0x1u << 19) /**< \brief (I2SMCC_ISRA) I2S Receive Right 1 or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR/RHLxR) */
#define I2SMCC_ISRA_RXLRDY2 (0x1u << 20) /**< \brief (I2SMCC_ISRA) I2S Receive Left 2 or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR/RHLxR) */
#define I2SMCC_ISRA_RXRRDY2 (0x1u << 21) /**< \brief (I2SMCC_ISRA) I2S Receive Right 2 or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR/RHLxR) */
#define I2SMCC_ISRA_RXLRDY3 (0x1u << 22) /**< \brief (I2SMCC_ISRA) I2S Receive Left 3 or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR/RHLxR) */
#define I2SMCC_ISRA_RXRRDY3 (0x1u << 23) /**< \brief (I2SMCC_ISRA) I2S Receive Right 3 or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR/RHLxR) */
#define I2SMCC_ISRA_RXLOVF0 (0x1u << 24) /**< \brief (I2SMCC_ISRA) I2S Receive Left 0 or TDM Channel 2x Overrun Flag (Cleared on read) */
#define I2SMCC_ISRA_RXROVF0 (0x1u << 25) /**< \brief (I2SMCC_ISRA) I2S Receive Right 0 or TDM Channel [2x]+1 Overrun Flag (Cleared on read) */
#define I2SMCC_ISRA_RXLOVF1 (0x1u << 26) /**< \brief (I2SMCC_ISRA) I2S Receive Left 1 or TDM Channel 2x Overrun Flag (Cleared on read) */
#define I2SMCC_ISRA_RXROVF1 (0x1u << 27) /**< \brief (I2SMCC_ISRA) I2S Receive Right 1 or TDM Channel [2x]+1 Overrun Flag (Cleared on read) */
#define I2SMCC_ISRA_RXLOVF2 (0x1u << 28) /**< \brief (I2SMCC_ISRA) I2S Receive Left 2 or TDM Channel 2x Overrun Flag (Cleared on read) */
#define I2SMCC_ISRA_RXROVF2 (0x1u << 29) /**< \brief (I2SMCC_ISRA) I2S Receive Right 2 or TDM Channel [2x]+1 Overrun Flag (Cleared on read) */
#define I2SMCC_ISRA_RXLOVF3 (0x1u << 30) /**< \brief (I2SMCC_ISRA) I2S Receive Left 3 or TDM Channel 2x Overrun Flag (Cleared on read) */
#define I2SMCC_ISRA_RXROVF3 (0x1u << 31) /**< \brief (I2SMCC_ISRA) I2S Receive Right 3 or TDM Channel [2x]+1 Overrun Flag (Cleared on read) */
/* -------- I2SMCC_IERB : (I2SMCC Offset: 0x20) Interrupt Enable Register B -------- */
#define I2SMCC_IERB_WERR (0x1u << 0) /**< \brief (I2SMCC_IERB) Write Error Interrupt Enable */
#define I2SMCC_IERB_ENDTX (0x1u << 4) /**< \brief (I2SMCC_IERB) End of Transmit Buffer Interrupt Enable */
#define I2SMCC_IERB_ENDRX (0x1u << 5) /**< \brief (I2SMCC_IERB) End of Receive Buffer Interrupt Enable */
#define I2SMCC_IERB_TXBUFE (0x1u << 6) /**< \brief (I2SMCC_IERB) Transmit Buffer Empty Interrupt Enable */
#define I2SMCC_IERB_RXBUFF (0x1u << 7) /**< \brief (I2SMCC_IERB) Receive Buffer Full Interrupt Enable */
/* -------- I2SMCC_IDRB : (I2SMCC Offset: 0x24) Interrupt Disable Register B -------- */
#define I2SMCC_IDRB_WERR (0x1u << 0) /**< \brief (I2SMCC_IDRB) Write Error Interrupt Disable */
#define I2SMCC_IDRB_ENDTX (0x1u << 4) /**< \brief (I2SMCC_IDRB) End of Transmit Buffer Interrupt Disable */
#define I2SMCC_IDRB_ENDRX (0x1u << 5) /**< \brief (I2SMCC_IDRB) End of Receive Buffer Interrupt Disable */
#define I2SMCC_IDRB_TXBUFE (0x1u << 6) /**< \brief (I2SMCC_IDRB) Transmit Buffer Empty Interrupt Disable */
#define I2SMCC_IDRB_RXBUFF (0x1u << 7) /**< \brief (I2SMCC_IDRB) Receive Buffer Full Interrupt Disable */
/* -------- I2SMCC_IMRB : (I2SMCC Offset: 0x28) Interrupt Mask Register B -------- */
#define I2SMCC_IMRB_WERR (0x1u << 0) /**< \brief (I2SMCC_IMRB) Write Error Interrupt Enable */
#define I2SMCC_IMRB_ENDTX (0x1u << 4) /**< \brief (I2SMCC_IMRB) End of Transmit Buffer Interrupt Mask */
#define I2SMCC_IMRB_ENDRX (0x1u << 5) /**< \brief (I2SMCC_IMRB) End of Receive Buffer Interrupt Mask */
#define I2SMCC_IMRB_TXBUFE (0x1u << 6) /**< \brief (I2SMCC_IMRB) Transmit Buffer Empty Interrupt Mask */
#define I2SMCC_IMRB_RXBUFF (0x1u << 7) /**< \brief (I2SMCC_IMRB) Receive Buffer Full Interrupt Mask */
/* -------- I2SMCC_ISRB : (I2SMCC Offset: 0x2C) Interrupt Status Register B -------- */
#define I2SMCC_ISRB_WERR (0x1u << 0) /**< \brief (I2SMCC_ISRB) Write Error Flag (cleared on read) */
#define I2SMCC_ISRB_ENDTX (0x1u << 4) /**< \brief (I2SMCC_ISRB) End of TX Buffer (cleared by writing I2SMCC_TCR or I2SMCC_TNCR) */
#define I2SMCC_ISRB_ENDRX (0x1u << 5) /**< \brief (I2SMCC_ISRB) End of RX Buffer (cleared by writing I2SMCC_RCR or I2SMCC_RNCR) */
#define I2SMCC_ISRB_TXBUFE (0x1u << 6) /**< \brief (I2SMCC_ISRB) Transmit Buffer Empty (cleared by writing I2SMCC_TCR or I2SMCC_TNCR) */
#define I2SMCC_ISRB_RXBUFF (0x1u << 7) /**< \brief (I2SMCC_ISRB) Receive Buffer Full (cleared by writing I2SMCC_RCR or I2SMCC_RNCR) */
/* -------- I2SMCC_RHR : (I2SMCC Offset: 0x30) Receiver Holding Register -------- */
#define I2SMCC_RHR_RHR_Pos 0
#define I2SMCC_RHR_RHR_Msk (0xffffffffu << I2SMCC_RHR_RHR_Pos) /**< \brief (I2SMCC_RHR) Receiver Holding Register */
/* -------- I2SMCC_THR : (I2SMCC Offset: 0x34) Transmitter Holding Register -------- */
#define I2SMCC_THR_THR_Pos 0
#define I2SMCC_THR_THR_Msk (0xffffffffu << I2SMCC_THR_THR_Pos) /**< \brief (I2SMCC_THR) Transmitter Holding Register */
#define I2SMCC_THR_THR(value) ((I2SMCC_THR_THR_Msk & ((value) << I2SMCC_THR_THR_Pos)))
/* -------- I2SMCC_RHL0R : (I2SMCC Offset: 0x40) Receiver Holding Left 0 Register -------- */
#define I2SMCC_RHL0R_RHL_Pos 0
#define I2SMCC_RHL0R_RHL_Msk (0xffffffffu << I2SMCC_RHL0R_RHL_Pos) /**< \brief (I2SMCC_RHL0R) Receiver Holding Left */
/* -------- I2SMCC_RHR0R : (I2SMCC Offset: 0x44) Receiver Holding Right 0 Register -------- */
#define I2SMCC_RHR0R_RHR_Pos 0
#define I2SMCC_RHR0R_RHR_Msk (0xffffffffu << I2SMCC_RHR0R_RHR_Pos) /**< \brief (I2SMCC_RHR0R) Receiver Holding Right */
/* -------- I2SMCC_RHL1R : (I2SMCC Offset: 0x48) Receiver Holding Left 1 Register -------- */
#define I2SMCC_RHL1R_RHL_Pos 0
#define I2SMCC_RHL1R_RHL_Msk (0xffffffffu << I2SMCC_RHL1R_RHL_Pos) /**< \brief (I2SMCC_RHL1R) Receiver Holding Left */
/* -------- I2SMCC_RHR1R : (I2SMCC Offset: 0x4C) Receiver Holding Right 1 Register -------- */
#define I2SMCC_RHR1R_RHR_Pos 0
#define I2SMCC_RHR1R_RHR_Msk (0xffffffffu << I2SMCC_RHR1R_RHR_Pos) /**< \brief (I2SMCC_RHR1R) Receiver Holding Right */
/* -------- I2SMCC_RHL2R : (I2SMCC Offset: 0x50) Receiver Holding Left 2 Register -------- */
#define I2SMCC_RHL2R_RHL_Pos 0
#define I2SMCC_RHL2R_RHL_Msk (0xffffffffu << I2SMCC_RHL2R_RHL_Pos) /**< \brief (I2SMCC_RHL2R) Receiver Holding Left */
/* -------- I2SMCC_RHR2R : (I2SMCC Offset: 0x54) Receiver Holding Right 2 Register -------- */
#define I2SMCC_RHR2R_RHR_Pos 0
#define I2SMCC_RHR2R_RHR_Msk (0xffffffffu << I2SMCC_RHR2R_RHR_Pos) /**< \brief (I2SMCC_RHR2R) Receiver Holding Right */
/* -------- I2SMCC_RHL3R : (I2SMCC Offset: 0x58) Receiver Holding Left 3 Register -------- */
#define I2SMCC_RHL3R_RHL_Pos 0
#define I2SMCC_RHL3R_RHL_Msk (0xffffffffu << I2SMCC_RHL3R_RHL_Pos) /**< \brief (I2SMCC_RHL3R) Receiver Holding Left */
/* -------- I2SMCC_RHR3R : (I2SMCC Offset: 0x5C) Receiver Holding Right 3 Register -------- */
#define I2SMCC_RHR3R_RHR_Pos 0
#define I2SMCC_RHR3R_RHR_Msk (0xffffffffu << I2SMCC_RHR3R_RHR_Pos) /**< \brief (I2SMCC_RHR3R) Receiver Holding Right */
/* -------- I2SMCC_THL0R : (I2SMCC Offset: 0x60) Transmitter Holding Left 0 Register -------- */
#define I2SMCC_THL0R_THL_Pos 0
#define I2SMCC_THL0R_THL_Msk (0xffffffffu << I2SMCC_THL0R_THL_Pos) /**< \brief (I2SMCC_THL0R) Transmitter Holding Left */
#define I2SMCC_THL0R_THL(value) ((I2SMCC_THL0R_THL_Msk & ((value) << I2SMCC_THL0R_THL_Pos)))
/* -------- I2SMCC_THR0R : (I2SMCC Offset: 0x64) Transmitter Holding Right 0 Register -------- */
#define I2SMCC_THR0R_THR_Pos 0
#define I2SMCC_THR0R_THR_Msk (0xffffffffu << I2SMCC_THR0R_THR_Pos) /**< \brief (I2SMCC_THR0R) Transmitter Holding Right */
#define I2SMCC_THR0R_THR(value) ((I2SMCC_THR0R_THR_Msk & ((value) << I2SMCC_THR0R_THR_Pos)))
/* -------- I2SMCC_THL1R : (I2SMCC Offset: 0x68) Transmitter Holding Left 1 Register -------- */
#define I2SMCC_THL1R_THL_Pos 0
#define I2SMCC_THL1R_THL_Msk (0xffffffffu << I2SMCC_THL1R_THL_Pos) /**< \brief (I2SMCC_THL1R) Transmitter Holding Left */
#define I2SMCC_THL1R_THL(value) ((I2SMCC_THL1R_THL_Msk & ((value) << I2SMCC_THL1R_THL_Pos)))
/* -------- I2SMCC_THR1R : (I2SMCC Offset: 0x6C) Transmitter Holding Right 1 Register -------- */
#define I2SMCC_THR1R_THR_Pos 0
#define I2SMCC_THR1R_THR_Msk (0xffffffffu << I2SMCC_THR1R_THR_Pos) /**< \brief (I2SMCC_THR1R) Transmitter Holding Right */
#define I2SMCC_THR1R_THR(value) ((I2SMCC_THR1R_THR_Msk & ((value) << I2SMCC_THR1R_THR_Pos)))
/* -------- I2SMCC_THL2R : (I2SMCC Offset: 0x70) Transmitter Holding Left 2 Register -------- */
#define I2SMCC_THL2R_THL_Pos 0
#define I2SMCC_THL2R_THL_Msk (0xffffffffu << I2SMCC_THL2R_THL_Pos) /**< \brief (I2SMCC_THL2R) Transmitter Holding Left */
#define I2SMCC_THL2R_THL(value) ((I2SMCC_THL2R_THL_Msk & ((value) << I2SMCC_THL2R_THL_Pos)))
/* -------- I2SMCC_THR2R : (I2SMCC Offset: 0x74) Transmitter Holding Right 2 Register -------- */
#define I2SMCC_THR2R_THR_Pos 0
#define I2SMCC_THR2R_THR_Msk (0xffffffffu << I2SMCC_THR2R_THR_Pos) /**< \brief (I2SMCC_THR2R) Transmitter Holding Right */
#define I2SMCC_THR2R_THR(value) ((I2SMCC_THR2R_THR_Msk & ((value) << I2SMCC_THR2R_THR_Pos)))
/* -------- I2SMCC_THL3R : (I2SMCC Offset: 0x78) Transmitter Holding Left 3 Register -------- */
#define I2SMCC_THL3R_THL_Pos 0
#define I2SMCC_THL3R_THL_Msk (0xffffffffu << I2SMCC_THL3R_THL_Pos) /**< \brief (I2SMCC_THL3R) Transmitter Holding Left */
#define I2SMCC_THL3R_THL(value) ((I2SMCC_THL3R_THL_Msk & ((value) << I2SMCC_THL3R_THL_Pos)))
/* -------- I2SMCC_THR3R : (I2SMCC Offset: 0x7C) Transmitter Holding Right 3 Register -------- */
#define I2SMCC_THR3R_THR_Pos 0
#define I2SMCC_THR3R_THR_Msk (0xffffffffu << I2SMCC_THR3R_THR_Pos) /**< \brief (I2SMCC_THR3R) Transmitter Holding Right */
#define I2SMCC_THR3R_THR(value) ((I2SMCC_THR3R_THR_Msk & ((value) << I2SMCC_THR3R_THR_Pos)))
/* -------- I2SMCC_WPMR : (I2SMCC Offset: 0xE4) Write Protection Mode Register -------- */
#define I2SMCC_WPMR_WPCFEN (0x1u << 0) /**< \brief (I2SMCC_WPMR) Write Protection Configuration Enable */
#define I2SMCC_WPMR_WPITEN (0x1u << 1) /**< \brief (I2SMCC_WPMR) Write Protection Interrupt Enable */
#define I2SMCC_WPMR_WPCTEN (0x1u << 2) /**< \brief (I2SMCC_WPMR) Write Protection Control Enable */
#define I2SMCC_WPMR_WPKEY_Pos 8
#define I2SMCC_WPMR_WPKEY_Msk (0xffffffu << I2SMCC_WPMR_WPKEY_Pos) /**< \brief (I2SMCC_WPMR) Write Protection Key */
#define I2SMCC_WPMR_WPKEY(value) ((I2SMCC_WPMR_WPKEY_Msk & ((value) << I2SMCC_WPMR_WPKEY_Pos)))
#define   I2SMCC_WPMR_WPKEY_PASSWD (0x493253u << 8) /**< \brief (I2SMCC_WPMR) Writing any other value in this field aborts the write operation. Always reads as 0. */
/* -------- I2SMCC_WPSR : (I2SMCC Offset: 0xE8) Write Protection Status Register -------- */
#define I2SMCC_WPSR_WPVS (0x1u << 0) /**< \brief (I2SMCC_WPSR) Write Protection Violation Status */
#define I2SMCC_WPSR_WPVSRC_Pos 8
#define I2SMCC_WPSR_WPVSRC_Msk (0xffffffu << I2SMCC_WPSR_WPVSRC_Pos) /**< \brief (I2SMCC_WPSR) Write Protection Violation Source */
/* -------- I2SMCC_RPR : (I2SMCC Offset: 0x100) Receive Pointer Register -------- */
#define I2SMCC_RPR_RXPTR_Pos 0
#define I2SMCC_RPR_RXPTR_Msk (0xffffffffu << I2SMCC_RPR_RXPTR_Pos) /**< \brief (I2SMCC_RPR) Receive Pointer Register */
#define I2SMCC_RPR_RXPTR(value) ((I2SMCC_RPR_RXPTR_Msk & ((value) << I2SMCC_RPR_RXPTR_Pos)))
/* -------- I2SMCC_RCR : (I2SMCC Offset: 0x104) Receive Counter Register -------- */
#define I2SMCC_RCR_RXCTR_Pos 0
#define I2SMCC_RCR_RXCTR_Msk (0xffffu << I2SMCC_RCR_RXCTR_Pos) /**< \brief (I2SMCC_RCR) Receive Counter Register */
#define I2SMCC_RCR_RXCTR(value) ((I2SMCC_RCR_RXCTR_Msk & ((value) << I2SMCC_RCR_RXCTR_Pos)))
/* -------- I2SMCC_TPR : (I2SMCC Offset: 0x108) Transmit Pointer Register -------- */
#define I2SMCC_TPR_TXPTR_Pos 0
#define I2SMCC_TPR_TXPTR_Msk (0xffffffffu << I2SMCC_TPR_TXPTR_Pos) /**< \brief (I2SMCC_TPR) Transmit Counter Register */
#define I2SMCC_TPR_TXPTR(value) ((I2SMCC_TPR_TXPTR_Msk & ((value) << I2SMCC_TPR_TXPTR_Pos)))
/* -------- I2SMCC_TCR : (I2SMCC Offset: 0x10C) Transmit Counter Register -------- */
#define I2SMCC_TCR_TXCTR_Pos 0
#define I2SMCC_TCR_TXCTR_Msk (0xffffu << I2SMCC_TCR_TXCTR_Pos) /**< \brief (I2SMCC_TCR) Transmit Counter Register */
#define I2SMCC_TCR_TXCTR(value) ((I2SMCC_TCR_TXCTR_Msk & ((value) << I2SMCC_TCR_TXCTR_Pos)))
/* -------- I2SMCC_RNPR : (I2SMCC Offset: 0x110) Receive Next Pointer Register -------- */
#define I2SMCC_RNPR_RXNPTR_Pos 0
#define I2SMCC_RNPR_RXNPTR_Msk (0xffffffffu << I2SMCC_RNPR_RXNPTR_Pos) /**< \brief (I2SMCC_RNPR) Receive Next Pointer */
#define I2SMCC_RNPR_RXNPTR(value) ((I2SMCC_RNPR_RXNPTR_Msk & ((value) << I2SMCC_RNPR_RXNPTR_Pos)))
/* -------- I2SMCC_RNCR : (I2SMCC Offset: 0x114) Receive Next Counter Register -------- */
#define I2SMCC_RNCR_RXNCTR_Pos 0
#define I2SMCC_RNCR_RXNCTR_Msk (0xffffu << I2SMCC_RNCR_RXNCTR_Pos) /**< \brief (I2SMCC_RNCR) Receive Next Counter */
#define I2SMCC_RNCR_RXNCTR(value) ((I2SMCC_RNCR_RXNCTR_Msk & ((value) << I2SMCC_RNCR_RXNCTR_Pos)))
/* -------- I2SMCC_TNPR : (I2SMCC Offset: 0x118) Transmit Next Pointer Register -------- */
#define I2SMCC_TNPR_TXNPTR_Pos 0
#define I2SMCC_TNPR_TXNPTR_Msk (0xffffffffu << I2SMCC_TNPR_TXNPTR_Pos) /**< \brief (I2SMCC_TNPR) Transmit Next Pointer */
#define I2SMCC_TNPR_TXNPTR(value) ((I2SMCC_TNPR_TXNPTR_Msk & ((value) << I2SMCC_TNPR_TXNPTR_Pos)))
/* -------- I2SMCC_TNCR : (I2SMCC Offset: 0x11C) Transmit Next Counter Register -------- */
#define I2SMCC_TNCR_TXNCTR_Pos 0
#define I2SMCC_TNCR_TXNCTR_Msk (0xffffu << I2SMCC_TNCR_TXNCTR_Pos) /**< \brief (I2SMCC_TNCR) Transmit Counter Next */
#define I2SMCC_TNCR_TXNCTR(value) ((I2SMCC_TNCR_TXNCTR_Msk & ((value) << I2SMCC_TNCR_TXNCTR_Pos)))
/* -------- I2SMCC_PTCR : (I2SMCC Offset: 0x120) Transfer Control Register -------- */
#define I2SMCC_PTCR_RXTEN (0x1u << 0) /**< \brief (I2SMCC_PTCR) Receiver Transfer Enable */
#define I2SMCC_PTCR_RXTDIS (0x1u << 1) /**< \brief (I2SMCC_PTCR) Receiver Transfer Disable */
#define I2SMCC_PTCR_TXTEN (0x1u << 8) /**< \brief (I2SMCC_PTCR) Transmitter Transfer Enable */
#define I2SMCC_PTCR_TXTDIS (0x1u << 9) /**< \brief (I2SMCC_PTCR) Transmitter Transfer Disable */
#define I2SMCC_PTCR_RXCBEN (0x1u << 16) /**< \brief (I2SMCC_PTCR) Receiver Circular Buffer Enable */
#define I2SMCC_PTCR_RXCBDIS (0x1u << 17) /**< \brief (I2SMCC_PTCR) Receiver Circular Buffer Disable */
#define I2SMCC_PTCR_TXCBEN (0x1u << 18) /**< \brief (I2SMCC_PTCR) Transmitter Circular Buffer Enable */
#define I2SMCC_PTCR_TXCBDIS (0x1u << 19) /**< \brief (I2SMCC_PTCR) Transmitter Circular Buffer Disable */
#define I2SMCC_PTCR_ERRCLR (0x1u << 24) /**< \brief (I2SMCC_PTCR) Transfer Bus Error Clear */
/* -------- I2SMCC_PTSR : (I2SMCC Offset: 0x124) Transfer Status Register -------- */
#define I2SMCC_PTSR_RXTEN (0x1u << 0) /**< \brief (I2SMCC_PTSR) Receiver Transfer Enable */
#define I2SMCC_PTSR_TXTEN (0x1u << 8) /**< \brief (I2SMCC_PTSR) Transmitter Transfer Enable */
#define I2SMCC_PTSR_RXCBEN (0x1u << 16) /**< \brief (I2SMCC_PTSR) Receiver Circular Buffer Enable */
#define I2SMCC_PTSR_TXCBEN (0x1u << 18) /**< \brief (I2SMCC_PTSR) Transmitter Circular Buffer Enable */
#define I2SMCC_PTSR_ERR (0x1u << 24) /**< \brief (I2SMCC_PTSR) Transfer Bus Error */
/* -------- I2SMCC_PWPMR : (I2SMCC Offset: 0x128) Write Protection Mode Register -------- */
#define I2SMCC_PWPMR_WPPTREN (0x1u << 0) /**< \brief (I2SMCC_PWPMR) Write Protection Pointer Registers Enable */
#define I2SMCC_PWPMR_WPCTREN (0x1u << 1) /**< \brief (I2SMCC_PWPMR) Write Protection Counter Registers Enable */
#define I2SMCC_PWPMR_WPCREN (0x1u << 2) /**< \brief (I2SMCC_PWPMR) Write Protection Control Register Enable */
#define I2SMCC_PWPMR_WPKEY_Pos 8
#define I2SMCC_PWPMR_WPKEY_Msk (0xffffffu << I2SMCC_PWPMR_WPKEY_Pos) /**< \brief (I2SMCC_PWPMR) Write Protection Key */
#define I2SMCC_PWPMR_WPKEY(value) ((I2SMCC_PWPMR_WPKEY_Msk & ((value) << I2SMCC_PWPMR_WPKEY_Pos)))
#define   I2SMCC_PWPMR_WPKEY_PASSWD (0x504443u << 8) /**< \brief (I2SMCC_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. */

/*@}*/


#endif /* _PIC32CX_I2SMCC_COMPONENT_ */
